[
  {
    "id": 1,
    "img": "https://i.ibb.co/f9yr9y4/1.png",
    "name": "Luxury Sedan",
    "rating": 4.5,
    "price": 5000,
    "description": "Experience the epitome of luxury and performance with our flagship sedan model. The sleek design, coupled with advanced safety features and cutting-edge technology, ensures a comfortable and secure ride. Enjoy a spacious and finely crafted interior, making every journey a luxurious experience."
  },
  {
    "id": 2,
    "img": "https://i.ibb.co/Yp3K5zD/2.png",
    "name": "Sports Coupe",
    "rating": 4.2,
    "price": 6000,
    "description": "Feel the thrill of the road with our high-performance sports coupe designed for speed enthusiasts. The aerodynamic shape and powerful engine deliver an exhilarating driving experience. Immerse yourself in a cockpit that blends style with functionality, and let the roar of the engine become the soundtrack to your adventures."
  },
  {
    "id": 3,
    "img": "https://i.ibb.co/94QS7KR/3.png",
    "name": "Family SUV",
    "rating": 4.8,
    "price": 4500,
    "description": "Spacious and safe, our family SUV is perfect for all your adventures with loved ones. With ample seating and versatile cargo space, this SUV adapts to your family's changing needs. Advanced safety features and modern entertainment options make every journey comfortable and enjoyable for the whole family."
  },
  {
    "id": 4,
    "img": "https://i.ibb.co/QYVB5Yd/4.png",
    "name": "Electric Hatchback",
    "rating": 4.7,
    "price": 3500,
    "description": "Join the eco-friendly revolution with our sleek and efficient electric hatchback. Enjoy the convenience of zero-emission driving without compromising on style or performance. The cutting-edge electric technology, paired with a modern and chic design, makes this hatchback the perfect choice for environmentally conscious and tech-savvy drivers."
  },
  {
    "id": 5,
    "img": "https://i.ibb.co/8jH0mRj/5.png",
    "name": "Off-Road 4x4",
    "rating": 4.6,
    "price": 5500,
    "description": "Conquer any terrain with our rugged and powerful off-road 4x4 vehicle. Engineered for adventure, this off-road beast combines robust performance with advanced off-road capabilities. Whether you're navigating rocky trails or cruising through mud, our 4x4 ensures that no terrain is too challenging for your exploration."
  },
  {
    "id": 6,
    "img": "https://i.ibb.co/xzqX3gy/6.png",
    "name": "Convertible Roadster",
    "rating": 4.4,
    "price": 7000,
    "description": "Experience the freedom of the open road with our stylish and convertible roadster. This sleek and aerodynamic convertible is not just a car; it's a statement. Feel the wind in your hair as you drive, and indulge in the perfect blend of elegance and excitement. Unleash your inner adventurer with the top down and the road stretching ahead."
  },
  {
    "id": 7,
    "img": "https://i.ibb.co/f9yr9y4/1.png",
    "name": "Compact Commuter",
    "rating": 4.0,
    "price": 2500,
    "description": "Efficient and compact, our commuter car is perfect for city living and daily commuting. Maneuver through traffic with ease, park effortlessly in tight spaces, and enjoy impressive fuel efficiency. The compact design doesn't compromise on comfort, making it an ideal choice for those who prioritize convenience without sacrificing quality."
  },
  {
    "id": 8,
    "img": "https://i.ibb.co/Yp3K5zD/2.png",
    "name": "Hybrid Crossover",
    "rating": 4.5,
    "price": 4000,
    "description": "Enjoy the best of both worlds with our versatile hybrid crossover model. This crossover seamlessly combines a fuel-efficient gasoline engine with an electric motor, providing exceptional mileage and reduced environmental impact. Experience a comfortable and spacious interior, along with advanced technology features that make every journey enjoyable."
  },
  {
    "id": 9,
    "img": "https://i.ibb.co/94QS7KR/3.png",
    "name": "Classic Roadster",
    "rating": 4.3,
    "price": 8000,
    "description": "Relive the golden era of motoring with our timeless and classic roadster design. Meticulously crafted with attention to detail, this roadster captures the essence of vintage style while incorporating modern amenities. Cruise the streets in sophistication and turn heads with the timeless elegance of our classic roadster."
  },
  {
    "id": 10,
    "img": "https://i.ibb.co/QYVB5Yd/4.png",
    "name": "Economy Hatchback",
    "rating": 3.9,
    "price": 2000,
    "description": "Affordable and fuel-efficient, our economy hatchback is perfect for budget-conscious drivers. Experience reliability and practicality without breaking the bank. The compact size makes it easy to maneuver in urban environments, while the fuel efficiency ensures that you get the most mileage out of every gallon, saving you money in the long run."
  },
  {
    "id": 11,
    "img": "https://i.ibb.co/8jH0mRj/5.png",
    "name": "Luxury SUV",
    "rating": 4.6,
    "price": 6500,
    "description": "Combine luxury and utility with our high-end luxury SUV model. Indulge in opulent interiors, advanced safety features, and powerful performance. Whether you're navigating city streets or embarking on a road trip, our luxury SUV ensures a premium driving experience for those who demand the best in comfort and style."
  },
  {
    "id": 12,
    "img": "https://i.ibb.co/xzqX3gy/6.png",
    "name": "Performance Sedan",
    "rating": 4.4,
    "price": 5500,
    "description": "Unleash the power on the road with our high-performance sedan built for enthusiasts. From the responsive handling to the powerful engine, every aspect of this sedan is designed to deliver an exhilarating driving experience. Immerse yourself in luxury and performance, and redefine your expectations of what a sedan can be."
  }
]