[
  {
    "id": 1,
    "img": "https://i.ibb.co/BBgb8fG/1.png",
    "name": "Alice Johnson",
    "profession": "Marketing Manager",
    "comment": "I had an absolutely amazing experience with this car garage. The service was not only prompt but also delivered with a level of expertise that truly impressed me. The staff demonstrated a deep understanding of automotive issues and fixed my car's problem efficiently. I highly recommend their services to anyone seeking top-notch car maintenance and repairs.",
    "date": "2023-03-10",
    "rating": 5
  },
  {
    "id": 2,
    "img": "https://i.ibb.co/k4Lf0sG/2.png",
    "name": "Bob Smith",
    "profession": "Software Engineer",
    "comment": "I can't speak highly enough of the excellent work done on my car by the team at this garage. Their skill and professionalism are truly commendable. They not only addressed the specific issue I brought my car in for but also went above and beyond to ensure that my entire vehicle was in top condition. As a satisfied customer, I highly recommend their services.",
    "date": "2023-02-18",
    "rating": 4.5
  },
  {
    "id": 3,
    "img": "https://i.ibb.co/Bz0yLcz/3.png",
    "name": "Charlie Brown",
    "profession": "Teacher",
    "comment": "I want to express my appreciation for the honesty and transparency demonstrated by this garage. When I brought my car in, they took the time to thoroughly explain the issues, providing clear insights into the necessary repairs. The team's fair estimate and timely completion of the work exceeded my expectations. My car now runs like new, thanks to their dedication.",
    "date": "2023-01-25",
    "rating": 4
  },
  {
    "id": 4,
    "img": "https://i.ibb.co/1XN48YF/4.png",
    "name": "Diana Rodriguez",
    "profession": "Nurse",
    "comment": "Fast and reliable service defines my experience with this garage. The team's friendly and knowledgeable approach was evident from the moment I arrived. They not only fixed my car quickly but also took the time to answer all my questions, providing valuable insights into maintaining my vehicle. I'm grateful for their professionalism and highly recommend their services.",
    "date": "2022-12-05",
    "rating": 4.8
  },
  {
    "id": 5,
    "img": "https://i.ibb.co/r6GJNG2/5.png",
    "name": "Ethan Turner",
    "profession": "Graphic Designer",
    "comment": "The service at this garage is truly top-notch! When I brought my car in for regular maintenance, the staff conducted a thorough inspection, ensuring that no detail was overlooked. Moreover, they shared useful tips for maintaining my vehicle, showcasing their commitment to customer education. I'm highly impressed and recommend this garage without reservation.",
    "date": "2022-11-15",
    "rating": 5
  },
  {
    "id": 6,
    "img": "https://i.ibb.co/qsscZmT/6.png",
    "name": "Fiona Harris",
    "profession": "Real Estate Agent",
    "comment": "I had an entirely positive experience at this garage. The courteous and attentive nature of the team, combined with their precision in handling repairs, left a lasting impression. The fair pricing and excellent customer service make them stand out among the rest. I'm confident in recommending this garage for anyone seeking reliable automotive services.",
    "date": "2022-10-02",
    "rating": 4.5
  }
]